# -*- coding: utf-8 -*-


from enum import IntEnum


class 合法性等級(IntEnum):
    無效, 強非法, 弱非法, 弱合法, 稀有合法, 強合法 = range(6)

    @property
    def 字符串(self) -> str:
        return self.name


# 以下規則只適用於更優音韻地位
# (合法性等級, 禁止的情況, 排除的情況)
音位配列規則表 = [
    (合法性等級.無效, '陰聲韻 入聲', None),
    (合法性等級.無效, '邪章昌船書常日以羣母 一二四等', None),
    (合法性等級.無效, '端組 二三等', None),  # 地打
    (合法性等級.強非法, '次入韻', '去聲'),
    (合法性等級.強非法, '幫組 之韻', None),
    (合法性等級.強非法, '陽唐庚耕清青蒸登韻 銳音 合口', '以母 清韻'),
    (合法性等級.強非法, '四等 合口 銳音', None),
    (合法性等級.強非法, '云母 開口', '宵侵鹽韻'),
    (合法性等級.強非法, '麻韻 三等', '銳音 開口'),
    (合法性等級.強非法, '侵鹽韻 重紐A類', '影母'),
    (合法性等級.強非法, '俟母', '之韻'),
    (合法性等級.弱非法, '來母 二等', None),
    (合法性等級.弱非法, '歌韻 三等', '見影組 平聲'),
    (合法性等級.弱非法, '痕韻 銳音', None),
    (合法性等級.弱非法, '幫組 蕭添韻', None),
    (合法性等級.弱非法, '祭韻 見影組 重紐A類', '影母'),
    (合法性等級.弱非法, '祭韻 幫組 重紐B類', None),
    (合法性等級.弱合法, '冬韻 鈍音 舒聲', None),
    (合法性等級.弱合法, '船母 尤之東陽祭宵鹽韻', None),
    (合法性等級.弱合法, '麻韻 三等 知組', None),
    (合法性等級.弱合法, '蒸韻 合口 舒聲', None),
    (合法性等級.弱合法, '東韻 三等 上聲', None),
    (合法性等級.弱合法, '佳麻皆夬韻 合口 知組', None),
    (合法性等級.弱合法, '山刪韻 合口 舒聲 知組', None),
    (合法性等級.稀有合法, '銜韻 知組', None),
    (合法性等級.稀有合法, '云母 鍾韻', None),
    (合法性等級.稀有合法, '脂仙宵韻 見影組 開口 重紐A類', '影母'),
    (合法性等級.稀有合法, '幫組 咸覃銜談韻', None),
    (合法性等級.稀有合法, '脂韻 莊組', '生母'),
    (合法性等級.稀有合法, '真臻韻 莊組 合口', '生母 入聲'),
    (合法性等級.稀有合法, '蒸韻 上聲', None),
    (合法性等級.稀有合法, '登韻 合口 上去聲', None),
    (合法性等級.稀有合法, '冬韻 上聲', None),
    (合法性等級.稀有合法, '皆韻 上聲', '見影組 開口'),
    (合法性等級.稀有合法, '邪母 虞東宵韻', None),
]
