# -*- coding: utf-8 -*-

'''
音韻學常用常量。
'''

# class 常量:

#     Examples:

#         >>> Qieyun.常量.重紐母
#         '幫滂並明見溪羣疑影曉'
#         >>> '溪' in Qieyun.常量.重紐母
#         True
#     '''

所有母 = '幫滂並明端透定泥來知徹澄孃精清從心邪莊初崇生俟章昌常書船日見溪羣疑影曉匣云以'
'''str: 所有母'''

所有呼 = '開合'
'''str: 所有呼'''

所有等 = '一二三四'
'''str: 所有等'''

所有重紐 = 'AB'
'''str: 所有重紐'''

所有韻 = '東冬鍾江支脂之微魚虞模齊祭泰佳皆夬灰咍廢眞臻文欣元魂痕寒刪山仙先蕭宵肴豪歌麻陽唐庚耕清青蒸登尤侯幽侵覃談鹽添咸銜嚴凡'
'''str: 所有韻'''

所有聲 = '平上去入'
'''str: 所有聲'''


重紐母 = '幫滂並明見溪羣疑影曉'
'''str: 重紐母'''

重紐韻 = '支脂祭眞仙宵清侵鹽'
'''str: 重紐韻'''


開合皆有的韻 = '支脂微齊祭泰佳皆夬廢眞元寒刪山仙先歌麻陽唐庚耕清青蒸登'
'''str: 開合皆有的韻'''

必爲開口的韻 = '咍痕欣嚴之魚臻蕭宵肴豪侯侵覃談鹽添咸銜'
'''str: 必爲開口的韻'''

必爲合口的韻 = '灰魂文凡'
'''str: 必爲合口的韻'''

開合中立的韻 = '東冬鍾江虞模尤幽'
'''str: 開合中立的韻'''


一等韻 = '冬模泰咍灰痕魂寒豪唐登侯覃談'
'''str: 一等韻'''

二等韻 = '江佳皆夬刪山肴耕咸銜'
'''str: 二等韻'''

三等韻 = '鍾支脂之微魚虞祭廢眞臻欣元文仙宵陽清蒸尤幽侵鹽嚴凡'
'''str: 三等韻'''

四等韻 = '齊先蕭青添'
'''str: 四等韻'''

一三等韻 = '東歌'
'''str: 一三等韻'''

二三等韻 = '麻庚'
'''str: 二三等韻'''


輕脣韻 = '東鍾微虞廢文元陽尤凡'
'''str: 輕脣韻'''


次入韻 = '祭泰夬廢'
'''str: 次入韻'''

